Reports/КонтрольОшибокПоДоговорамАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>КонтрольОшибокПоДоговорамАренды</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ПланируемыеПлатежиПоДоговорамАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПланируемыеПлатежиПоДоговорамАренды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыНачисленияАренднойПлаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАренднойПлаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАренднойПлаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыДоговоровАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДоговоровАренды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокУведомленияОПерезаключении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалютДляРасчетовПоАренде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалютДляРасчетовПоАренде</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаКурсаВалюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НижняяГраница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерхняяГраница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийДоговоровАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДоговоровАренды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>САрендодателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>САрендатором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРасчетаКурсаВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаКурсаВалюты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КурсЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДвухКурсовВалютДеленнаяПололам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийППИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийППИсходящее</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПостояннойЧастиАрендыАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПеременнойЧастиАрендыАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозитаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПостояннойЧастиАрендыАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПеременнойЧастиАрендыАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДепозитаАрендатору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗППоВедомости</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеИностраннойВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписаниеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаУслугБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЭквайринга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЭквайрингаСводно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличныхСРасчетногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПоИсполнительнымЛистам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСКорпоративныхКарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаОткрытиеКорпоративнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеДепозита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыАренднойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыАренднойПлаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПостояннаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеременнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостояннаяЧастьНДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеременнаяЧастьНДФЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КонтрольОшибокПоДоговорамАренды/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Период) КАК Период,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор КАК Договор,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата КАК Дата
	                      |ПОМЕСТИТЬ ВТ_ПериодыПланируемыхПлатежейПредварительно
	                      |ИЗ
	                      |	РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды.СрезПоследних КАК ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних
	                      |ГДЕ
	                      |	НАЧАЛОПЕРИОДА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата, МЕСЯЦ) = &МесяцАренды
	                      |	И (ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем)
	                      |			ИЛИ ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Регистратор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем))
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ПериодыПланируемыхПлатежейПредварительно.Период,
	                      |	ВТ_ПериодыПланируемыхПлатежейПредварительно.Договор,
	                      |	ВТ_ПериодыПланируемыхПлатежейПредварительно.Дата
	                      |ПОМЕСТИТЬ ВТ_ПериодыПланируемыхПлатежей
	                      |ИЗ
	                      |	ВТ_ПериодыПланируемыхПлатежейПредварительно КАК ВТ_ПериодыПланируемыхПлатежейПредварительно
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДоговоровАренды.СрезПоследних КАК СтатусыДоговоровАрендыСрезПоследних
	                      |		ПО ВТ_ПериодыПланируемыхПлатежейПредварительно.Договор = СтатусыДоговоровАрендыСрезПоследних.Договор
	                      |			И ВТ_ПериодыПланируемыхПлатежейПредварительно.Дата >= СтатусыДоговоровАрендыСрезПоследних.ДатаНачалаАренды
	                      |			И ВТ_ПериодыПланируемыхПлатежейПредварительно.Дата <= СтатусыДоговоровАрендыСрезПоследних.ДатаОкончанияАренды
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор КАК Договор,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Валюта,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ФормаОплаты КАК ФормаОплаты,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ТипАренднойПлаты КАК ТипАренднойПлаты,
	                      |	СУММА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Сумма) КАК Сумма,
	                      |	СУММА(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.СуммаВал) КАК СуммаВал
	                      |ПОМЕСТИТЬ ВТ_Начислено
	                      |ИЗ
	                      |	РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды.СрезПоследних КАК ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыПланируемыхПлатежей КАК ВТ_ПериодыПланируемыхПлатежей
	                      |		ПО ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Период = ВТ_ПериодыПланируемыхПлатежей.Период
	                      |			И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор = ВТ_ПериодыПланируемыхПлатежей.Договор
	                      |			И ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Дата = ВТ_ПериодыПланируемыхПлатежей.Дата
	                      |ГДЕ
	                      |	(ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Сумма <> 0
	                      |			ИЛИ ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.СуммаВал <> 0)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Договор,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ФормаОплаты,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.ТипАренднойПлаты,
	                      |	ПланируемыеПлатежиПоДоговорамАрендыСрезПоследних.Валюта
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Начислено.Договор КАК Договор,
	                      |	ВТ_Начислено.ФормаОплаты КАК ФормаОплаты,
	                      |	ВТ_Начислено.ТипАренднойПлаты КАК ТипАренднойПлаты,
	                      |	ВТ_Начислено.Сумма,
	                      |	ВТ_Начислено.СуммаВал,
	                      |	КурсыВалютДляРасчетовПоАрендеСрезПоследних.СпособРасчета,
	                      |	КурсыВалютДляРасчетовПоАрендеСрезПоследних.Валюта КАК Валюта,
	                      |	КурсыВалютДляРасчетовПоАрендеСрезПоследних.Валюта2,
	                      |	КурсыВалютДляРасчетовПоАрендеСрезПоследних.НижняяГраница,
	                      |	КурсыВалютДляРасчетовПоАрендеСрезПоследних.ВерхняяГраница,
	                      |	КурсыВалютДляРасчетовПоАрендеСрезПоследних.Курс,
	                      |	КурсыВалютДляРасчетовПоАрендеСрезПоследних.Кратность,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Начислено.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК ПлатежПоОсновнойВалюте,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Начислено.Валюта <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	                      |			ТОГДА &ВалютаРегл
	                      |		КОГДА КурсыВалютДляРасчетовПоАрендеСрезПоследних.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.СуммаДвухКурсовВалютДеленнаяПололам)
	                      |			ТОГДА ""Бивалюта""
	                      |		ИНАЧЕ КурсыВалютДляРасчетовПоАрендеСрезПоследних.Валюта
	                      |	КОНЕЦ КАК ВалютаРезультат
	                      |ИЗ
	                      |	ВТ_Начислено КАК ВТ_Начислено
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовПоАренде.СрезПоследних(КОНЕЦПЕРИОДА(&МесяцАренды, МЕСЯЦ), ) КАК КурсыВалютДляРасчетовПоАрендеСрезПоследних
	                      |		ПО ВТ_Начислено.Договор = КурсыВалютДляРасчетовПоАрендеСрезПоследних.ДоговорКонтрагента
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Договор,
	                      |	ФормаОплаты,
	                      |	ТипАренднойПлаты,
	                      |	ПлатежПоОсновнойВалюте УБЫВ");
						  
	Запрос.УстановитьПараметр("МесяцАренды", НачалоМесяца(КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("МесяцАренды").Значение));
	Запрос.УстановитьПараметр("ВалютаРегл", мВалютаРегл);
	
	ТаблицаНачислений = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходИзБанка.ДоговорКонтрагента КАК Договор,
	               |	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) КАК ФормаОплаты,
	               |	ВЫБОР
	               |		КОГДА РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	               |	КОНЕЦ КАК ТипАренднойПлаты,
	               |	РасходИзБанка.ДатаОплаты КАК ДатаОплаты,
	               |	РасходИзБанка.СуммаДокумента
	               |ИЗ
	               |	Документ.РасходИзБанка КАК РасходИзБанка
	               |ГДЕ
	               |	РасходИзБанка.Проведен
	               |	И РасходИзБанка.Оплачено
	               |	И РасходИзБанка.ДоговорКонтрагента В(&Договоры)
	               |	И РасходИзБанка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПеременнойЧастиАрендыАрендодателю))
	               |	И НАЧАЛОПЕРИОДА(РасходИзБанка.ПериодРегистрации, МЕСЯЦ) = &МесяцАренды
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РасходИзКассы.ДоговорКонтрагента,
	               |	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные),
	               |	ВЫБОР
	               |		КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	               |	КОНЕЦ,
	               |	НАЧАЛОПЕРИОДА(РасходИзКассы.Ссылка.Дата, ДЕНЬ),
	               |	РасходИзКассы.СуммаДокумента
	               |ИЗ
	               |	Документ.РасходИзКассы КАК РасходИзКассы
	               |ГДЕ
	               |	РасходИзКассы.Проведен
	               |	И РасходИзКассы.ДоговорКонтрагента В(&Договоры)
	               |	И РасходИзКассы.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПеременнойЧастиАрендыАрендодателю))
	               |	И НАЧАЛОПЕРИОДА(РасходИзКассы.ПериодРегистрации, МЕСЯЦ) = &МесяцАренды
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗачетОплатыАрендыЗачетДепозита.Ссылка.ДоговорКонтрагента,
	               |	ЗачетОплатыАрендыЗачетДепозита.ФормаОплаты,
	               |	ЗачетОплатыАрендыЗачетДепозита.ТипАренднойПлаты,
	               |	НАЧАЛОПЕРИОДА(ЗачетОплатыАрендыЗачетДепозита.Ссылка.Дата, ДЕНЬ),
	               |	ЗачетОплатыАрендыЗачетДепозита.Сумма
	               |ИЗ
	               |	Документ.ЗачетОплатыАренды.ЗачетДепозита КАК ЗачетОплатыАрендыЗачетДепозита
	               |ГДЕ
	               |	ЗачетОплатыАрендыЗачетДепозита.Ссылка.Проведен
	               |	И ЗачетОплатыАрендыЗачетДепозита.Ссылка.ДоговорКонтрагента В(&Договоры)
	               |	И НАЧАЛОПЕРИОДА(ЗачетОплатыАрендыЗачетДепозита.ПериодРегистрации, МЕСЯЦ) = &МесяцАренды
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Договор,
	               |	ФормаОплаты,
	               |	ТипАренднойПлаты,
	               |	ДатаОплаты";
				   
	Запрос.УстановитьПараметр("Договоры",  ТаблицаНачислений.ВыгрузитьКолонку("Договор"));	
	
	ТаблицаОплат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаНачисленийИОплат = ТаблицаНачислений.СкопироватьКолонки();	
	ТаблицаНачисленийИОплат.Колонки.Добавить("Начислено", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТаблицаНачисленийИОплат.Колонки.Добавить("Оплачено", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	
	Для Каждого СтрокаНачисления Из ТаблицаНачислений Цикл
		
		ЭтоВалютныйПлатеж =  (СтрокаНачисления.ПлатежПоОсновнойВалюте И 
												 (СтрокаНачисления.Валюта <> мВалютаРегл  ИЛИ	
												 (СтрокаНачисления.СпособРасчета <> Перечисления.СпособыРасчетаКурсаВалюты.КурсЦБ И СтрокаНачисления.СпособРасчета <> Перечисления.СпособыРасчетаКурсаВалюты.ПустаяСсылка())));
												 
		Оплачено = 0;
		Начислено = ?(ЭтоВалютныйПлатеж, СтрокаНачисления.СуммаВал, СтрокаНачисления.Сумма);
												 
		СтруктураОтбора = Новый Структура("Договор, ФормаОплаты, ТипАренднойПлаты");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаНачисления);
		
		СтрокиОплаты = ТаблицаОплат.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаОплаты Из СтрокиОплаты Цикл
			//Если ЭтоВалютныйПлатеж И СтрокаНачисления.СуммаВал = 0 ИЛИ НЕ ЭтоВалютныйПлатеж И СтрокаНачисления.Сумма = 0 Тогда
			//	Прервать;
			//КонецЕсли;
			
			Если ЭтоВалютныйПлатеж Тогда
				КурсВалюты = ПроцедурыНачисления.ПолучитьКурсВалютыПоДоговору(СтрокаОплаты.ДатаОплаты, СтрокаНачисления).Курс;	
				СуммаДокументаВал = СтрокаОплаты.СуммаДокумента/КурсВалюты;
				
				//СуммаКЗачету =  Мин(СтрокаНачисления.СуммаВал, СуммаДокументаВал );
				СуммаКЗачету =  СуммаДокументаВал;
				
				СтрокаНачисления.СуммаВал = СтрокаНачисления.СуммаВал - СуммаКЗачету;
				//Если СуммаКЗачету = СуммаДокументаВал Тогда
				//	СтрокаОплаты.СуммаДокумента = 0;
				//Иначе
				//	СтрокаОплаты.СуммаДокумента = СтрокаОплаты.СуммаДокумента - СуммаКЗачету*КурсВалюты;
				//КонецЕсли;
			Иначе
				//СуммаКЗачету = Мин(СтрокаНачисления.Сумма,  СтрокаОплаты.СуммаДокумента); 
				//Сообщить("" + СтрокаНачисления.Договор + " --- " + СтрокаОплаты.СуммаДокумента);
				СуммаКЗачету = СтрокаОплаты.СуммаДокумента; 
				СтрокаНачисления.Сумма = СтрокаНачисления.Сумма - СуммаКЗачету;
				//СтрокаОплаты.СуммаДокумента = СтрокаОплаты.СуммаДокумента - СуммаКЗачету;
			КонецЕсли;			
			
			Оплачено = Оплачено  + СуммаКЗачету;			
			
		КонецЦикла;
		
		Если ЭтоВалютныйПлатеж И СтрокаНачисления.СуммаВал <> 0 ИЛИ НЕ ЭтоВалютныйПлатеж И СтрокаНачисления.Сумма <> 0 Тогда
			СтрокаРезультата = ТаблицаНачисленийИОплат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультата, СтрокаНачисления);
			СтрокаРезультата.Начислено = Начислено;
			СтрокаРезультата.Оплачено = Оплачено;
		КонецЕсли;
		
	КонецЦикла;
	
	//
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
							Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,	Новый Структура("ТаблицаНачисленийИОплат", ТаблицаНачисленийИОплат), ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
